; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	spectrograph0 - mode
	image2 - mode
	spectrograph1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	GroundStation10 - direction
	Star6 - direction
	GroundStation13 - direction
	Star3 - direction
	Star14 - direction
	Star12 - direction
	Star0 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
	Star19 - direction
	Planet20 - direction
	Star21 - direction
	Star22 - direction
	Phenomenon23 - direction
	Planet24 - direction
	Phenomenon25 - direction
	Planet26 - direction
	Phenomenon27 - direction
	Star28 - direction
	Phenomenon29 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation10)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument2 spectrograph1)
	(supports instrument2 image2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star3)
	(supports instrument3 image2)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star12)
	(calibration_target instrument4 Star14)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument5 image2)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation13)
)
(:goal (and
	(pointing satellite2 GroundStation5)
	(pointing satellite3 GroundStation5)
	(have_image Phenomenon15 spectrograph1)
	(have_image Planet16 spectrograph0)
	(have_image Planet17 image2)
	(have_image Planet18 spectrograph1)
	(have_image Star19 spectrograph1)
	(have_image Planet20 spectrograph0)
	(have_image Star21 spectrograph1)
	(have_image Star22 spectrograph0)
	(have_image Phenomenon23 image2)
	(have_image Planet24 spectrograph0)
	(have_image Phenomenon25 spectrograph1)
	(have_image Planet26 image2)
	(have_image Phenomenon27 spectrograph0)
	(have_image Star28 image2)
	(have_image Phenomenon29 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star0 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star0)
   goals met: 0 of 17
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 17
3. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 17
4. (turn_to satellite1 phenomenon29 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon29)
   goals met: 0 of 17
5. (take_image satellite1 phenomenon29 instrument2 spectrograph0)
   added: (have_image phenomenon29 spectrograph0)
   goals met: 1 of 17
6. (turn_to satellite1 phenomenon27 phenomenon29)
   deleted: (pointing satellite1 phenomenon29)
   added: (pointing satellite1 phenomenon27)
   goals met: 1 of 17
7. (take_image satellite1 phenomenon27 instrument2 spectrograph0)
   added: (have_image phenomenon27 spectrograph0)
   goals met: 2 of 17
8. (turn_to satellite1 phenomenon25 phenomenon27)
   deleted: (pointing satellite1 phenomenon27)
   added: (pointing satellite1 phenomenon25)
   goals met: 2 of 17
9. (take_image satellite1 phenomenon25 instrument2 spectrograph1)
   added: (have_image phenomenon25 spectrograph1)
   goals met: 3 of 17
10. (turn_to satellite1 phenomenon23 phenomenon25)
   deleted: (pointing satellite1 phenomenon25)
   added: (pointing satellite1 phenomenon23)
   goals met: 3 of 17
11. (take_image satellite1 phenomenon23 instrument2 image2)
   added: (have_image phenomenon23 image2)
   goals met: 4 of 17
12. (turn_to satellite1 phenomenon15 phenomenon23)
   deleted: (pointing satellite1 phenomenon23)
   added: (pointing satellite1 phenomenon15)
   goals met: 4 of 17
13. (take_image satellite1 phenomenon15 instrument2 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 5 of 17
14. (turn_to satellite1 planet16 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet16)
   goals met: 5 of 17
15. (take_image satellite1 planet16 instrument2 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 6 of 17
16. (turn_to satellite1 planet17 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet17)
   goals met: 6 of 17
17. (take_image satellite1 planet17 instrument2 image2)
   added: (have_image planet17 image2)
   goals met: 7 of 17
18. (turn_to satellite1 planet18 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet18)
   goals met: 7 of 17
19. (take_image satellite1 planet18 instrument2 spectrograph1)
   added: (have_image planet18 spectrograph1)
   goals met: 8 of 17
20. (turn_to satellite1 planet20 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 planet20)
   goals met: 8 of 17
21. (take_image satellite1 planet20 instrument2 spectrograph0)
   added: (have_image planet20 spectrograph0)
   goals met: 9 of 17
22. (turn_to satellite1 planet24 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 planet24)
   goals met: 9 of 17
23. (take_image satellite1 planet24 instrument2 spectrograph0)
   added: (have_image planet24 spectrograph0)
   goals met: 10 of 17
24. (turn_to satellite1 planet26 planet24)
   deleted: (pointing satellite1 planet24)
   added: (pointing satellite1 planet26)
   goals met: 10 of 17
25. (take_image satellite1 planet26 instrument2 image2)
   added: (have_image planet26 image2)
   goals met: 11 of 17
26. (turn_to satellite1 star19 planet26)
   deleted: (pointing satellite1 planet26)
   added: (pointing satellite1 star19)
   goals met: 11 of 17
27. (take_image satellite1 star19 instrument2 spectrograph1)
   added: (have_image star19 spectrograph1)
   goals met: 12 of 17
28. (turn_to satellite1 star21 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 star21)
   goals met: 12 of 17
29. (take_image satellite1 star21 instrument2 spectrograph1)
   added: (have_image star21 spectrograph1)
   goals met: 13 of 17
30. (turn_to satellite1 star22 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 star22)
   goals met: 13 of 17
31. (take_image satellite1 star22 instrument2 spectrograph0)
   added: (have_image star22 spectrograph0)
   goals met: 14 of 17
32. (turn_to satellite1 star28 star22)
   deleted: (pointing satellite1 star22)
   added: (pointing satellite1 star28)
   goals met: 14 of 17
33. (take_image satellite1 star28 instrument2 image2)
   added: (have_image star28 image2)
   goals met: 15 of 17
34. (turn_to satellite2 groundstation5 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation5)
   goals met: 16 of 17
35. (turn_to satellite3 groundstation5 groundstation13)
   deleted: (pointing satellite3 groundstation13)
   added: (pointing satellite3 groundstation5)
   goals met: 17 of 17
